validation/oneWayCoupledVdfTransportFoam/sizeTaylorGreen/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel sizeVelocity;

sizeVelocityCoeffs
{
    odeCoeffs
    {
        solveOde on;
        solveSources on;

        ATol    1.0e-4;
        RTol    1.0e-3;
        fac     0.7;
        facMin  0.5;
        facMax  2.0;
        minLocalDt 1.0e-10;
    }

    collision  on;

    collisionKernel
    {
        collisionKernel esBGK;
        e           0.8;
    }

    aggregation on;
    aggregationKernel
    {
        aggregationKernel sum;

        Ca        Ca        [ 0 0 -1 0 0 0 0 ] 20.0;
    }

    breakup on;
    breakupKernel
    {
        breakupKernel powerLaw;
        Cb        Cb        [ 0 0 -1 0 0 0 0 ] 0.02;

        daughterDistribution
        {
            daughterDistribution symmetricFragmentation;
        }
    }
}

// ************************************************************************* //
